RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_вм_НастройкиПрограммы/рдв_вм_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>рдв_вм_НастройкиПрограммы</name>
  <comment>VELO-613, VELO-691, VELO-702, VELO-605, VELO-609, VELO-610, VELO-614, VELO-604, VELO-891, VELO-746, VELO-782, VELO-777, VELO-759, VELO-1205, VELO-1428, VELO-1600, VELO-1587, VELO-1654, VELO-1789, VELO-1833, VELO-1819, VELO-2166, VELO-2201</comment>
  <type>
    <types>CatalogRef.рдв_ВнешниеСистемы</types>
    <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидНоменклатурыДляПечати</name>
      <description>Вид номенклатуры для печати</description>
    </items>
    <items>
      <name>ДилерскийПортал</name>
      <description>Дилерский портал</description>
    </items>
    <items>
      <name>ЗагрузкаPackingList</name>
      <description>Загрузка Packing List</description>
    </items>
    <items>
      <name>ЗагрузкаЭлектронныхГТД</name>
      <description>Загрузка электронных ГТД</description>
    </items>
    <items>
      <name>ИдентификаторыДополнительныхРеквизитов</name>
      <description>Идентификаторы дополнительных реквизитов</description>
    </items>
    <items>
      <name>ИнтеграцияСДокументооборотом</name>
      <description>Интеграция с документооборотом</description>
    </items>
    <items>
      <name>НастройкиПечати</name>
      <description>Настройки печати</description>
    </items>
    <items>
      <name>НастройкиПоУмолчанию</name>
      <description>Настройки по умолчанию</description>
    </items>
    <items>
      <name>ОтправкаПечатныхФорм</name>
      <description>Отправка печатных форм</description>
    </items>
    <items>
      <name>РаспределениеМатериаловИРабот</name>
      <description>Распределение материалов и работ</description>
    </items>
    <items>
      <name>РДВМаркет</name>
      <description>РДВ Маркет</description>
    </items>
    <items>
      <name>СлужебныйТипизацияКлючейСоответствий</name>
      <description>Служебный. Типизация ключей соответствий</description>
    </items>
    <items>
      <name>ФункциональныеНастройки</name>
      <description>Функциональные настройки</description>
    </items>
    <items>
      <name>ВидЦеныТН</name>
      <description>Вид цены (ТН)</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПодразделенияДляАвтоматическогоРезервирования</name>
      <description>Подразделения для автоматического резервирования</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СегментыПартнеровСудоходныеКомпании</name>
      <description>Сегменты партнеров судоходные компании</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СкладыДляПроизводства</name>
      <description>Склады для производства</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СкладыОбеспечения</name>
      <description>Склады обеспечения</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СрокХраненияИнформацииОСнятыхРезервахВДнях</name>
      <description>Срок хранения информации о снятых резервах в днях</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>СтатьяСписанияГарантийныеРемонтыМОТО</name>
      <description>Статья списания гарантийные ремонты МОТО</description>
      <type>
        <types>CatalogRef.рдв_ВнешниеСистемы</types>
        <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>УслугаПоРемонтуВЕЛО</name>
      <description>Услуга по ремонту ВЕЛО</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Characteristic.рдв_вм_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.рдв_ВидыЗначенийНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рдв_вм_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначенияНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПовторноИспользуемыеЗначения</name>
    <comment>VELO-1699</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеЗначений</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Characteristic.рдв_вм_НастройкиПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_вм_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_вм_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

RDVMI.rdvmi-ext/src/Enums/рдв_ВидыЗначенийНастроек/рдв_ВидыЗначенийНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ВидыЗначенийНастроек</name>
  <comment>VELO-613</comment>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>СписокЗначений</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_вм_НастройкиПрограммы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	рдв_НастройкиПрограммы.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
 		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	рдв_НастройкиПрограммы.ПередИнтерактивнойЗаписюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	рдв_НастройкиПрограммы.ПриИнтерактивнойЗаписиНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	рдв_НастройкиПрограммы.ПослеИнтерактивнойЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидЗначенияПриИзменении(Элемент)

	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцеудурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВидимостьЭлементов(Форма)

	Элементы = Форма.Элементы;

	ИмяВидаСоответствие 	= "Перечисление.рдв_ВидыЗначенийНастроек.Соответствие";
	ВидЗначенияСоответствие	= ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ИмяВидаСоответствие);

	ЭтоСоответствиеЗначений = Форма.Объект.ВидЗначения = ВидЗначенияСоответствие;
	
	ИмяВидаСписокЗначений 		= "Перечисление.рдв_ВидыЗначенийНастроек.СписокЗначений";
	ВидЗначенияСписокЗначений	= ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ИмяВидаСписокЗначений);
	
	ЭтоСписокЗначений = Форма.Объект.ВидЗначения = ВидЗначенияСписокЗначений;
	
	Элементы.Значение.Видимость 			= Не ЭтоСоответствиеЗначений И Не ЭтоСписокЗначений;
	Элементы.Значения.Видимость				= ЭтоСписокЗначений;
	
	Элементы.СоответствиеЗначений.Видимость = ЭтоСоответствиеЗначений;
	Элементы.ТипКлюча.Видимость				= ЭтоСоответствиеЗначений;
	
КонецПроцедуры  

#КонецОбласти
